smurfix/micropython/ports/samd/boards/SPARKFUN_SAMD21_JOYSTICK/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Sparkfun Wireless Joystick"
#define MICROPY_HW_MCU_NAME   "SAMD21J18A"

#define MICROPY_HW_XOSC32K  (1)
